//Задача 3:
//Напишите программу, которая должна определить, пройдет ли кирпич в отверстие. 
//Размеры отверстия (длина и высота) вводит пользователь. Тоже самое касается габаритов кирпича, 
//пользователь вводит в программу значения длины, ширины и высоты кирпича.
Процедура ЗадачаПроКирпич ()
  Отверстие = Новый Массив (2);
  Кирпич = Новый Массив (3); 
  
  ОткрытьЗначение ("Введите два числа - длину и высоту отверстия");
  ВвестиЧисло(Отверстие[0], "Введите первое число");
  ВвестиЧисло(Отверстие[1], "Введите второе число");

  ОткрытьЗначение ("Введите ещё три числа - длину, ширину и высоту Кирпича");
  ВвестиЧисло(Кирпич[0], "Введите первое число");
  ВвестиЧисло(Кирпич[1], "Введите второе число");
  ВвестиЧисло(Кирпич[2], "Введите третье число");  

  ММ= Новый Массив (2,3);	
  Для Индекс1 = 0 По Отверстие.ВГраница() Цикл
      Для Индекс2 = 0 По Кирпич.ВГраница() Цикл
    	  Если Кирпич[Индекс2]<=Отверстие[Индекс1] Тогда
    		  ММ[Индекс1][Индекс2]= Истина;
    	  Иначе
    		  ММ[Индекс1][Индекс2]= Ложь;
    	  КонецЕсли;
      КонецЦикла;
  КонецЦикла; 
  Количество = 0;
  Для Индекс2 = 0 По Кирпич.ВГраница() Цикл
      Если ММ[0][Индекс2]+ММ[1][Индекс2] Тогда
        	Количество = Количество+1;
  	  КонецЕсли;
  КонецЦикла;    
  Если (ММ[0][0]+ММ[0][1]+ММ[0][2]) и (ММ[1][0]+ММ[1][1]+ММ[1][2]) и (Количество>=2) Тогда
      Сообщить("Кирпич пройдет в отверстие"); 
  Иначе 
      Сообщить("Кирпич не пройдет в отверстие");	  
  КонецЕсли;	
КонецПроцедуры 
