//Задача 3:
//Напишите программу, которая должна определить, пройдет ли кирпич в отверстие. 
//Размеры отверстия (длина и высота) вводит пользователь. Тоже самое касается габаритов кирпича, 
//пользователь вводит в программу значения длины, ширины и высоты кирпича.
Процедура ЗадачаПроКирпич()
	Отверстие = Новый Массив (2);
	Кирпич = Новый Массив (3); 
	//Ввод значений	
	ОткрытьЗначение ("Введите два числа - длину и высоту отверстия");
    	ВвестиЧисло(Отверстие[0], "Введите первое число");
	ВвестиЧисло(Отверстие[1], "Введите второе число");
	ОткрытьЗначение ("Введите ещё три числа - длину, ширину и высоту Кирпича");
	ВвестиЧисло(Кирпич[0], "Введите первое число");   
	ВвестиЧисло(Кирпич[1], "Введите второе число"); 
	ВвестиЧисло(Кирпич[2], "Введите третье число"); 
	//трехмерная фигура по условию. 
	//Для упрощения данной задачи достаточно исключить сторону с максимальной длиной
	//и сравнивать только две наименьшие стороны.
    	Сортировка = Новый СписокЗначений;
	Сортировка.ЗагрузитьЗначения(Кирпич);
	Сортировка.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	Кирпич = Сортировка.ВыгрузитьЗначения();
	Кирпич.Удалить(2);
	ПроверкаРазмеровФигурыДляОтверстия(Отверстие, Кирпич);
КонецПроцедуры

Процедура ПроверкаРазмеровФигурыДляОтверстия(Отверстие, Фигура)	
	Если (Отверстие[0] >= Фигура[0] и Отверстие[1] >= Фигура[1]) или
		 (Отверстие[0] >= Фигура[1] и Отверстие[1] >= Фигура[0]) Тогда
		Сообщить("Кирпич пройдет в отверстие");
	Иначе 
		//Существует возможность пройти в отверстие по диагонали
		ДиагональнаяПроверка(Отверстие, Фигура);	
	КонецЕсли;
КонецПроцедуры

Процедура ДиагональнаяПроверка(Отверстие, Фигура)
	//Напоминаю. Фигура тут двумерная.
	//Важная поправка. Алгоритм только для прямоугольных фигур. 
	//Для других фигур требуется знать угол и добавить в формулу диагоналей косинусы.
	ДиагональОтверстия = Sqrt(Pow(Отверстие[0], 2) + Pow(Отверстие[1], 2));
	//Элементы в фигуре отсортированы по возрастанию. Смотрим самую длинную сторону
	Если ДиагональОтверстия < Фигура[1] Тогда
		Сообщить("Кирпич не пройдет в отверстие");	
	Иначе
		//Вычисляем стороны треугольника образованного между сторонами отверстия и минимальной стороной кирпича.
		//Сторона кирпича встанет параллельно диагонали. Треугольники будут подобными.
		СоотношениеСторон = Фигура[0] / ДиагональОтверстия;
	    	Сторона1 = Отверстие[0] * СоотношениеСторон;
		Сторона2 = Отверстие[1] * СоотношениеСторон;
		//Считаем максимально возможную гипотенузу из нового получившегося треугольника
		МаксимальнаяВтораяСторонаКирпича = Sqrt(Pow(Отверстие[0] - Сторона1, 2) 
							+ Pow(Отверстие[1] - Сторона2, 2));
		//Сравниваем сторону кирпича и новую гипотенузу
		Если МаксимальнаяВтораяСторонаКирпича >= Фигура[1] Тогда
			Сообщить("Кирпич пройдет в отверстие по диагонали");
		Иначе
			Сообщить("Кирпич не пройдет в отверстие");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
